PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_hb_flash.c
/*******************************************************************************
* Function Name: CY_SMIF_HyperBus_ReadStatus
****************************************************************************//**
*
* This function reads the flash status register bits.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param regStatus
* output status register value.
*
*******************************************************************************/
cy_en_smif_status_t CY_SMIF_HyperBus_ReadStatus(SMIF_Type *base, const cy_stc_smif_mem_config_t *memConfig, uint16_t *regStatus, cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status;
    writeBuf   = (uint16_t)CY_SMIF_NOR_STATUS_REG_READ_CMD;
    uint16_t readstatus = 0x0000U;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );
    status = Cy_SMIF_HyperBus_MMIO_Read(base,
                                        memConfig->slaveSelect,
                                        CY_SMIF_HB_COUTINUOUS_BURST,
                                        0x0000U,
                                        HB_REG_SIZE_IN_HALFWORD,
                                        &readstatus,
                                        context->dummyCycles,
                                        false,
                                        true,
                                        context
                                       );
    *regStatus = readstatus;
    return status;
}

/*******************************************************************************
* Function Name: CY_SMIF_HyperBus_ClearStatus
****************************************************************************//**
*
* This function clears the flash status register bits.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
*******************************************************************************/
cy_en_smif_status_t CY_SMIF_HyperBus_ClearStatus(SMIF_Type *base, cy_stc_smif_mem_config_t *memConfig, cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status;
    writeBuf   = (uint16_t)CY_SMIF_NOR_STATUS_REG_CLEAR_CMD;

    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );
    return status;
}
/*******************************************************************************
* Function Name: Cy_SMIF_HyperBus_EraseSector
****************************************************************************//**
*
* This function Erases the data in the given sector.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param offset
* offset of the sector to be erased.
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_EraseSector(SMIF_Type *base, const cy_stc_smif_mem_config_t *memConfig, uint32_t offset, cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status;

    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA1;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA2;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR2,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_ERASE_SETUP_CMD;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA1;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA2;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR2,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_SECTOR_ERASE_CMD;

    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         offset,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    uint16_t readStatus = 0x0000U;
    uint16_t timeout = DEVICEREADY_CHECK_TIMEOUT;
    do
    {
        status = CY_SMIF_HyperBus_ReadStatus(base, memConfig, &readStatus, context);
        timeout --;
        Cy_SysLib_Delay(100U);
    }
    while (((readStatus & (uint16_t)CY_SMIF_DEV_RDY_MASK) == 0U) && (timeout > 0U));  // wait for the device becoming ready
    if (timeout == 0U)
    {
        status = CY_SMIF_EXCEED_TIMEOUT;
    }
    return status;
}

