PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_hb_flash.c
/*******************************************************************************
* Function Name: Cy_SMIF_HyperBus_EraseChip
****************************************************************************//**
*
* This function Erases the data in the entire flash memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_EraseChip(SMIF_Type *base, cy_stc_smif_mem_config_t *memConfig, cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status;
    uint16_t readStatus = 0x0000U;
    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA1;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA2;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR2,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_ERASE_SETUP_CMD;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA1;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA2;
    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR2,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,
                                         context
                                        );

    writeBuf = (uint16_t)CY_SMIF_NOR_CHIP_ERASE_CMD;

    status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                         memConfig->slaveSelect,
                                         CY_SMIF_HB_WRAPPED_BURST,
                                         (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                         HB_REG_SIZE_IN_HALFWORD,
                                         &writeBuf,
                                         CY_SMIF_HB_FLASH,
                                         context->dummyCycles,
                                         true,                    // Blocking mode
                                         context
                                        );

    uint16_t timeout = DEVICEREADY_CHECK_TIMEOUT;
    do
    {
        status = CY_SMIF_HyperBus_ReadStatus(base, memConfig, &readStatus, context);
        timeout --;
        Cy_SysLib_Delay(100U);
    }
    while (((readStatus & (uint16_t)CY_SMIF_DEV_RDY_MASK) == 0U) && (timeout > 0U));  // wait for the device becoming ready
    if (timeout == 0U)
    {
        status = CY_SMIF_EXCEED_TIMEOUT;
    }
    return status;
}
/* END of MMIO functions */



/*******************************************************************************
* Function Cy_SMIF_HyperBus_MMIO_Read
****************************************************************************//**
*
* This function reads data from hyper bus memory in MMIO mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Specifies slave of external device to be read. \ref cy_en_smif_slave_select_t
*
* \param burstType
* Specifies wrapped or continuous burst. \ref en_hb_bust_type_t
*
* \param readAddress
* Specifies address of external device to be read.
*
* \param sizeInHalfWord
* Specifies memory size to be read.
* Note hyper bus memory have 16bit data per each address.
*
* \param buf
* Pointer to buffer where read data to be stored
*
* \param lcCode
* Latency code. This value should be set also to the hyper bus device.
*
* \param dobleLat
* double initial latency or single initial latency
*
* \param isblockingMode
* Blocking mode or not. if this is true, process waits for the read finished in this
* function. unless, the process does not wait and exit function.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return \ref cy_en_smif_status_t
*
*******************************************************************************/
static cy_en_smif_status_t Cy_SMIF_HyperBus_MMIO_Read(SMIF_Type *base,
        cy_en_smif_slave_select_t slave,
        cy_en_hb_burst_type_t burstType,
        uint32_t readAddress,
        uint32_t sizeInHalfWord,
        uint16_t buf[],
        uint32_t dummyCycle,
        bool doubleLat,
        bool isblockingMode,
        cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status;
    uint32_t pageAddr = ((uint32_t)(readAddress >> 3u) & 0x00FFFFFFU);
    uint16_t addr_first_2bytes = (uint16_t)(pageAddr);
    // This is the last 8 bits of the 24 bit address. this should go in as part of command
    uint8_t addr_last_byte = (uint8_t)((pageAddr >> 16u));

    uint32_t address = (uint32_t)(_VAL2FLD(SMIF_HYPERBUS_ADR_LOWER_COL_ADDRESS,    readAddress) |
                                  _VAL2FLD(SMIF_HYPERBUS_ADR_BYTE_ENABLE,    0x0U) |
                                  _VAL2FLD(SMIF_HYPERBUS_ADR_ROW_AND_UPPER_COL_ADDRESS, addr_first_2bytes));
    uint32_t revOfAddr = Cy_SMIF_Reverse4ByteEndian(address);

